{
    "aWordOfWarning": "This is the story.json file. If you mess with it Adventure.py will not be able to run correctly.",
    "formatingRules": "All room and interactable names must be in Title Case. Every scentence must finish with a full stop.",
    "exposition": "The year is 2020. A global pandemic has taken over the world, and you're stuck at home. It's getting late, it's almost 1 AM now, but you haven't been able to sleep yet. Suddenly you hear a noise from downstairs. Better go check it out.",
    "rooms": [
        {
            "roomName": "Bedroom",
            "roomDescription": "This is your bedroom. Your computer and your phone are on your desk. It's cold in here. Someone's left the window open. This room connects to 'Hallway1'.",
            "roomLookAround": "Your computer and your phone are on your desk.",
            "roomInteractables": [
                {
                    "interactableName": "Computer",
                    "interactableText": "It's your computer. You can see an IDE open with an overcomplicated Python script on screen. You shudder at its ridiculousness.",
                    "interactableCollectable": false,
                    "interactableUseable": false
                },
                {
                    "interactableName": "Phone",
                    "interactableText": "It's your phone. It has a flashlight, which might be useful. Maybe you should bring it.",
                    "interactableCollectable": true,
                    "interactableUseable": false
                }
            ],
            "roomConnections": [
                "Hallway1"
            ]
        },
        {
            "roomName": "Hallway1",
            "roomDescription": "It's a hallway. It's even colder in here. The lights are off. This room connects to 'Bedroom' and 'Bathroom1'.",
            "roomLookAround": "There's a light switch on the wall.",
            "roomInteractables": [
                {
                    "interactableName": "Light Switch",
                    "interactableText": "It's a light switch. Not much else to it.",
                    "interactableCollectable": false,
                    "interactableUseable": true,
                    "interactableUseableDisabled": true,
                    "interactableUseText0": "The lights are off, turn them on?: ",
                    "interactableUseText1": "The lights are on, turn them off?: ",
                    "interactableDisabled": "The light switch isn't working right now."
                }
            ],
            "roomConnections": [
                "Bedroom", "Bathroom1"
            ]
        },
        {
            "roomName": "Bathroom1",
            "roomDescription": "It's a bathroom. This room connects to 'Hallway1'.",
            "roomLookAround": "There's nothing really in here.",
            "roomInteractables": [],
            "roomConnections": [
                "Hallway1"
            ]
        }
    ]
}